content/man/man1/flatpak-build-bundle.1.org
#+TITLE: Manpages - flatpak-build-bundle.1
* NAME
flatpak-build-bundle - Create a single-file bundle from a local
repository

* SYNOPSIS
*flatpak build-bundle* [OPTION...] LOCATION FILENAME NAME [BRANCH]

* DESCRIPTION
Creates a single-file named FILENAME for the application (or runtime)
named NAME in the repository at LOCATION. If a BRANCH is specified, this
branch of the application is used.

The collection ID set on the repository at LOCATION (if set) will be
used for the bundle.

Unless *--oci* is used, the format of the bundle file is that of an
ostree static delta (against an empty base) with some flatpak specific
metadata for the application icons and appdata.

* OPTIONS
The following options are understood:

*-h*, *--help*

#+begin_quote
Show help options and exit.

#+end_quote

*--runtime*

#+begin_quote
Export a runtime instead of an application.

#+end_quote

*--arch=ARCH*

#+begin_quote
The arch to create a bundle for. See *flatpak --supported-arches* for
architectures supported by the host.

#+end_quote

*--repo-url=URL*

#+begin_quote
The URL for the repository from which the application can be updated.
Installing the bundle will automatically configure a remote for this
URL.

#+end_quote

*--runtime-repo=URL*

#+begin_quote
The URL for a .flatpakrepo file that contains the information about the
repository that supplies the runtimes required by the app.

#+end_quote

*--gpg-keys=FILE*

#+begin_quote
Add the GPG key from FILE (use - for stdin).

#+end_quote

*--gpg-homedir=PATH*

#+begin_quote
GPG Homedir to use when looking for keyrings.

#+end_quote

*--from-commit=COMMIT*

#+begin_quote
The OSTree commit to create a delta bundle from.

#+end_quote

*--oci*

#+begin_quote
Export to an OCI image instead of a Flatpak bundle.

#+end_quote

*-v*, *--verbose*

#+begin_quote
Print debug information during command processing.

#+end_quote

*--ostree-verbose*

#+begin_quote
Print OSTree debug information during command processing.

#+end_quote

* EXAMPLES
*$ flatpak build-bundle /var/lib/flatpak/repo gnome-calculator.flatpak
org.gnome.Calculator stable*

*$ flatpak build-bundle ~/.local/share/flatpak/repo
gnome-calculator.flatpak org.gnome.Calculator stable*

* SEE ALSO
*ostree*(1), *flatpak*(1), *flatpak-build-init*(1), *flatpak-build*(1),
*flatpak-build-finish*(1), *flatpak-build-import-bundle*(1),
*flatpak-build-update-repo*(1)
