public/man/man1/flatpak-build-bundle.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - flatpak-build-bundle.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - flatpak-build-bundle.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>flatpak-build-bundle - Create a single-file bundle from a local
repository</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>flatpak build-bundle</strong> [OPTION…] LOCATION FILENAME NAME [BRANCH]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Creates a single-file named FILENAME for the application (or runtime)
named NAME in the repository at LOCATION. If a BRANCH is specified, this
branch of the application is used.</p>
<p>
The collection ID set on the repository at LOCATION (if set) will be
used for the bundle.</p>
<p>
Unless <strong>–oci</strong> is used, the format of the bundle file is that of an
ostree static delta (against an empty base) with some flatpak specific
metadata for the application icons and appdata.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>The following options are understood:</p>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Show help options and exit.</p>
</blockquote>
<p>
<strong>–runtime</strong></p>
<blockquote>
<p>Export a runtime instead of an application.</p>
</blockquote>
<p>
<strong>–arch=ARCH</strong></p>
<blockquote>
<p>The arch to create a bundle for. See <strong>flatpak –supported-arches</strong> for
architectures supported by the host.</p>
</blockquote>
<p>
<strong>–repo-url=URL</strong></p>
<blockquote>
<p>The URL for the repository from which the application can be updated.
Installing the bundle will automatically configure a remote for this
URL.</p>
</blockquote>
<p>
<strong>–runtime-repo=URL</strong></p>
<blockquote>
<p>The URL for a .flatpakrepo file that contains the information about the
repository that supplies the runtimes required by the app.</p>
</blockquote>
<p>
<strong>–gpg-keys=FILE</strong></p>
<blockquote>
<p>Add the GPG key from FILE (use - for stdin).</p>
</blockquote>
<p>
<strong>–gpg-homedir=PATH</strong></p>
<blockquote>
<p>GPG Homedir to use when looking for keyrings.</p>
</blockquote>
<p>
<strong>–from-commit=COMMIT</strong></p>
<blockquote>
<p>The OSTree commit to create a delta bundle from.</p>
</blockquote>
<p>
<strong>–oci</strong></p>
<blockquote>
<p>Export to an OCI image instead of a Flatpak bundle.</p>
</blockquote>
<p>
<strong>-v</strong>, <strong>–verbose</strong></p>
<blockquote>
<p>Print debug information during command processing.</p>
</blockquote>
<p>
<strong>–ostree-verbose</strong></p>
<blockquote>
<p>Print OSTree debug information during command processing.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
EXAMPLES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p><strong>$ flatpak build-bundle /var/lib/flatpak/repo gnome-calculator.flatpak
org.gnome.Calculator stable</strong></p>
<p>
<strong>$ flatpak build-bundle ~/.local/share/flatpak/repo
gnome-calculator.flatpak org.gnome.Calculator stable</strong></p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
SEE ALSO
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>*ostree*(1), *flatpak*(1), *flatpak-build-init*(1), *flatpak-build*(1),
*flatpak-build-finish*(1), *flatpak-build-import-bundle*(1),
*flatpak-build-update-repo*(1)</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
